alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/SVD/MDR32VF0xI/MDR1206/MDR1206FI.svd
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_28</name>
                    <displayName>CLICINT[28]_EXT_INT2</displayName>
                    <description>CLICINT[28]_EXT_INT2 description</description>
                    <addressOffset>0x00001070</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_29</name>
                    <displayName>CLICINT[29]_EXT_INT3</displayName>
                    <description>CLICINT[29]_EXT_INT3 description</description>
                    <addressOffset>0x00001074</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_30</name>
                    <displayName>CLICINT[30]_ADCUI_F03</displayName>
                    <description>CLICINT[30]_ADCUI_F03 description</description>
                    <addressOffset>0x00001078</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_31</name>
                    <displayName>CLICINT[31]_ADCUI_F1</displayName>
                    <description>CLICINT[31]_ADCUI_F1 description</description>
                    <addressOffset>0x0000107C</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_32</name>
                    <displayName>CLICINT[32]_ADCUI_F2</displayName>
                    <description>CLICINT[32]_ADCUI_F2 description</description>
                    <addressOffset>0x00001080</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_33</name>
                    <displayName>CLICINT[33]</displayName>
                    <description>CLICINT[33] description</description>
                    <addressOffset>0x00001084</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_34</name>
                    <displayName>CLICINT[34]</displayName>
                    <description>CLICINT[34] description</description>
                    <addressOffset>0x00001088</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_35</name>
                    <displayName>CLICINT[35]</displayName>
                    <description>CLICINT[35] description</description>
                    <addressOffset>0x0000108C</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_36</name>
                    <displayName>CLICINT[36]</displayName>
                    <description>CLICINT[36] description</description>
                    <addressOffset>0x00001090</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_37</name>
                    <displayName>CLICINT[37]_RANDOM</displayName>
                    <description>CLICINT[37]_RANDOM description</description>
                    <addressOffset>0x00001094</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_38</name>
                    <displayName>CLICINT[38]_ISO7816</displayName>
                    <description>CLICINT[38]_ISO7816 description</description>
                    <addressOffset>0x00001098</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_39</name>
                    <displayName>CLICINT[39]_UART3</displayName>
                    <description>CLICINT[39]_UART3 description</description>
                    <addressOffset>0x0000109C</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_40</name>
                    <displayName>CLICINT[40]_SSP2</displayName>
                    <description>CLICINT[40]_SSP2 description</description>
                    <addressOffset>0x000010A0</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_41</name>
                    <displayName>CLICINT[41]_SSP3</displayName>
                    <description>CLICINT[41]_SSP3 description</description>
                    <addressOffset>0x000010A4</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_42</name>
                    <displayName>CLICINT[42]_TIMER3</displayName>
                    <description>CLICINT[42]_TIMER3 description</description>
                    <addressOffset>0x000010A8</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_43</name>
                    <displayName>CLICINT[43]_TIMER4</displayName>
                    <description>CLICINT[43]_TIMER4 description</description>
                    <addressOffset>0x000010AC</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_44</name>
                    <displayName>CLICINT[44]_UART4</displayName>
                    <description>CLICINT[44]_UART4 description</description>
                    <addressOffset>0x000010B0</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_45</name>
                    <displayName>CLICINT[45]</displayName>
                    <description>CLICINT[45] description</description>
                    <addressOffset>0x000010B4</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_46</name>
                    <displayName>CLICINT[46]</displayName>
                    <description>CLICINT[46] description</description>
                    <addressOffset>0x000010B8</addressOffset>
                </register>
