alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/SVD/MDR32VF0xI/MDR1206/MDR1206FI.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="UART1">
            <name>UART2</name>
            <description>UART2 Controller</description>
            <groupName>UART2</groupName>
            <baseAddress>0x50010000</baseAddress>
            <interrupt>
                <name>UART2_IRQ</name>
                <value>2</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="UART1">
            <name>UART3</name>
            <description>UART3 Controller</description>
            <groupName>UART3</groupName>
            <baseAddress>0x50038000</baseAddress>
            <interrupt>
                <name>UART3_IRQ</name>
                <value>23</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="UART1">
            <name>UART4</name>
            <description>UART4 Controller</description>
            <groupName>UART4</groupName>
            <baseAddress>0x500E8000</baseAddress>
            <interrupt>
                <name>UART4_IRQ</name>
                <value>28</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>FLASH_CNTRL</name>
            <description>FLASH Memory Controller</description>
            <groupName>FLASH_CNTRL</groupName>
            <baseAddress>0x50018000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CMD</name>
                    <displayName>CMD</displayName>
                    <description>Control register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CON</name>
                            <description>Switching the FLASH memory controller to register control</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>Delay</name>
                            <description>Program memory delay when reading in cycles (in working mode)</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>XE</name>
                            <description>Output address ADR[17:9]</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>YE</name>
                            <description>Output address ADR[8:2]</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SE</name>
                            <description>Reading amplifier</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IFREN</name>
                            <description>Main/information block selection</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERASE</name>
                            <description>Erase 4 KB memory page</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MAS1</name>
                            <description>Erase the entire block when ERASE = 1</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PROG</name>
                            <description>Write data from the DI register</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NVSTR</name>
                            <description>Write or erase operations</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR</name>
                            <description>Reset FLASH test mode</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADR</name>
                    <displayName>ADR</displayName>
                    <description>Address register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>YADR</name>
                            <description>Word address</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>XADR</name>
                            <description>Main: XADR[9] - block number, XADR[8:3] - page address, XADR[2:0] - row address.
                                         Info: XADR[4] - block number, XADR[3] - page address, XADR[2:0] - row address</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DI</name>
                    <displayName>DI</displayName>
                    <description>Write data register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>DO</name>
                    <displayName>DO</displayName>
                    <description>Read data register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>KEY</name>
                    <displayName>KEY</displayName>
                    <description>Key register, 0x8AAA5551 unlocks the access</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CHIP_ID_CTRL</name>
                    <displayName>CHIP_ID_CTRL</displayName>
                    <description>Chip ID and OTP control register</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>OTP_PROG</name>
                            <description>OTP cell program bit</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OTPTST2</name>
                            <description>Test bit</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CHIP_ID</name>
                            <description>Chip ID field</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MDR1206AFI (ID=215)</name>
                                    <description>MDR1206AFI (ID=215)</description>
                                    <value>0xD7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MDR1206FI (ID=217)</name>
                                    <description>MDR1206FI (ID=217)</description>
                                    <value>0xD9</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OTP_KEY</name>
                    <displayName>OTP_KEY</displayName>
                    <description>OTP key register, 0x1555AAA8 unlocks access</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
