alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/SVD/MDR32VF0xI/MDR1206/MDR1206FI.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>RST_CLK</name>
            <description>RST_CLK description</description>
            <groupName>RST_CLK</groupName>
            <baseAddress>0x50020000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CLOCK_STATUS</name>
                    <displayName>CLOCK_STATUS</displayName>
                    <description>Status Register of Clock Control Unit</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PLL_CPU_RDY</name>
                            <description>"PLL is in the working mode" flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSE_RDY</name>
                            <description>"HSE is in the working mode" flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLL_CONTROL</name>
                    <displayName>PLL_CONTROL</displayName>
                    <description>PLL Control Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PLL_CPU_ON</name>
                            <description>Enables PLL</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLL_CPU_SEL</name>
                            <description>Selects PLL input frequency</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLL_CPU_MUL</name>
                            <description>Multiplication factor for CPU PLL</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HS_CONTROL</name>
                    <displayName>HS_CONTROL</displayName>
                    <description>High Speed Oscillator Control Register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>HSE_ON</name>
                            <description>Enables HSE</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSE_BYP</name>
                            <description>Selects oscillator or external generator</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CPU_CLOCK</name>
                    <displayName>CPU_CLOCK</displayName>
                    <description>CPU Clock Control Register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CPU_C1_SEL</name>
                            <description>Selects the source clock for CPU_C1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>HSI</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSI/2</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSE</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSE/2</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CPU_C2_SEL</name>
                            <description>Selects the source clock for CPU_C2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CPU_C1</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLLCPUo</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CPU_C3_SEL</name>
                            <description>Selects the divisor for CPU_C2 to produce CPU_C3</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>HCLK_SEL</name>
                            <description>Selects the source fo HCLK</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>HSI</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CPU_C3</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSE</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSI</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PER1_CLOCK</name>
                    <displayName>PER1_CLOCK</displayName>
                    <description>Peripheral Units Clock Control Register 1</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PER1_C1_SEL</name>
                            <description>Selects the source clock for PER_C1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LSI</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSI/2</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSE</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSE/2</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                            </field>
                            <field>
                            <name>PER1_C2_SEL</name>
                            <description>Selects the source clock for PER_C2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CPU_C1</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PER1_C1</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLLCPUo</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSI_C1</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>KEY_RESET_PROG</name>
                            <description>Resets the memory of the unique keys</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN</name>
                            <description>Enables DMA clocking</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WDG_C1_SEL</name>
                            <description>Selects the source clock for WDG_C1</description>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LSI</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSI/2</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSE</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSE/2</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>WDG_C2_SEL</name>
                            <description>Selects the source clock for WDG_C2</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CPU_C1</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>WDG_C1</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLLCPUo</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSI_C1</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>WDG_BGR</name>
                            <description>Selects the divisor of the WDG clock</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>WDG_CLK_EN</name>
                            <description>Enables WDG clocking</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_CLOCK</name>
                    <displayName>ADC_CLOCK</displayName>
                    <description>ADC and ADCUI Clock Control Register</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>ADC_C1_SEL</name>
                            <description>Selects the source clock for ADC_C1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CPU</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PER1_C1</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLLCPUo</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSE_C1</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ADCUI_C1_SEL</name>
                            <description>Selects the source clock for ADCUI_C1</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CPU</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PER1_C1</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLLCPUo</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSE_C1</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ADCUI_C3_SEL</name>
                            <description>Selects the divisor of ADCUI_C1 to produce ADCUI_C3</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADC_C3_SEL</name>
                            <description>Selects the divisor of ADC_C1 to produce ADCUI_C3</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADCUI_CLK_EN</name>
                            <description>Enables ADCUI clocking</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADC_CLK_EN</name>
                            <description>Enables ADC clocking</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CLOCK</name>
                    <displayName>RTC_CLOCK</displayName>
                    <description>RTC Clock Control Register</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>HSE_SEL</name>
                            <description>Selects the divisor of HSE to produce HSE_C1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>HSI_SEL</name>
                            <description>Selects the divisor of HSI to produce HSI_C1</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>HSE_RTC_EN</name>
                            <description>Enables RTC clocking with HSE</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSI_RTC_EN</name>
                            <description>Enables RTC clocking with HSI</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
