alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/SVD/MDR32VF0xI/MDR1206/MDR1206FI.svd
                <register>
                    <name>PER2_CLOCK</name>
                    <displayName>PER2_CLOCK</displayName>
                    <description>Peripheral Units Clock Control Register 2</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PCLK_EN_SSP1</name>
                            <description>Enables clocking of the SSP1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_UART1</name>
                            <description>Enables clocking of the UART1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_UART2</name>
                            <description>Enables clocking of the UART2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_FLASH</name>
                            <description>Enables clocking of the FLASH</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_RST_CLK</name>
                            <description>Enables clocking of the RST_CLK</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_DMA</name>
                            <description>Enables clocking of the DMA</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_I2C</name>
                            <description>nables clocking of the I2C</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_UART3</name>
                            <description>Enables clocking of the UART3</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_ADC</name>
                            <description>Enables clocking of the ADC</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_WWDG</name>
                            <description>Enables clocking of the WWDG</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_IWDG</name>
                            <description>Enables clocking of the IWDG</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_POWER</name>
                            <description>Enables clocking of the POWER Control Unit</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_BKP</name>
                            <description>Enables clocking of the  BKP</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_ADCUI</name>
                            <description>Enables clocking of the ADCUI</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_TIMER1</name>
                            <description>Enables clocking of the TIMER1</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_TIMER2</name>
                            <description>Enables clocking of the TIMER2</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_PORTA</name>
                            <description>Enables clocking of the PORTA</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_PORTB</name>
                            <description>Enables clocking of the PORTB</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_PORTC</name>
                            <description>Enables clocking of the PORTC</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_CRC</name>
                            <description>Enables clocking of the CRC Calculation Unit</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_RANDOM</name>
                            <description>Enables clocking of the Random Unit</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_USART</name>
                            <description>Enables clocking of the USART</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_SSP2</name>
                            <description>Enables clocking of the SSP2</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_SSP3</name>
                            <description>Enables clocking of the SSP3</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_TIMER3</name>
                            <description>Enables clocking of the TIMER3</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_TIMER4</name>
                            <description>Enables clocking of the TIMER4</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_UART4</name>
                            <description>Enables clocking of the UART4</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCLK_EN_PORTD</name>
                            <description>Enables clocking of the PORTD</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_DONE_STICK</name>
                    <displayName>DMA_DONE_STICK</displayName>
                    <description>Fixes DMA_DONE signals</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>TIM_CLOCK</name>
                    <displayName>TIM_CLOCK</displayName>
                    <description>Controls Timer clocking</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>TIM1_BRG</name>
                            <description>TIM1 prescaler</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TIM2_BRG</name>
                            <description>TIM2 prescaler</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TIM3_BRG</name>
                            <description>TIM3 prescaler</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TIM4_BRG</name>
                            <description>TIM4 prescaler</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TIM1_CLK_EN</name>
                            <description>Enables clocking for TIM1</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM2_CLK_EN</name>
                            <description>Enables clocking for TIM2</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM3_CLK_EN</name>
                            <description>Enables clocking for TIM3</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM4_CLK_EN</name>
                            <description>Enables clocking for TIM4</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UART_CLOCK</name>
                    <displayName>UART_CLOCK</displayName>
                    <description>UART Clock Register</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>UART1_BRG</name>
                            <description>UART1 prescaler</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>UART2_BRG</name>
                            <description>UART2 prescaler</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>UART3_BRG</name>
                            <description>UART3 prescaler</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>UART1_CLK_EN</name>
                            <description>Enables clocking for UART1</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART2_CLK_EN</name>
                            <description>Enables clocking for UART2</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART3_CLK_EN</name>
                            <description>Enables clocking for UART3</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART4_BRG</name>
                            <description>UART4 prescaler</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>UART4_CLK_EN</name>
                            <description>Enables clocking for UART4</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSP_CLOCK</name>
                    <displayName>SSP_CLOCK</displayName>
                    <description>SSP Clock Register</description>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>SSP1_BRG</name>
                            <description>SSP1 prescaler</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SSP2_BRG</name>
                            <description>SSP2 prescaler</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SSP3_BRG</name>
                            <description>SSP3 prescaler</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SSP1_CLK_EN</name>
                            <description>Enables clocking for SSP1</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SSP2_CLK_EN</name>
                            <description>Enables clocking for SSP2</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SSP3_CLK_EN</name>
                            <description>Enables clocking for SSP3</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIV_SYS_TIM</name>
                    <displayName>DIV_SYS_TIM</displayName>
                    <description>System Timer Clock Divisor Register</description>
                    <addressOffset>0x00000030</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DIV_SYS_TIM</name>
                            <description>CLK_TIMER_PULSE = HCLK/(DIV_SYS_TIM + 2)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
