alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/SVD/MDR32VF0xI/MDR1206/MDR1206FI.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>I2C</name>
            <description>I2C Controller</description>
            <groupName>I2C</groupName>
            <baseAddress>0x50030000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>I2C_IRQ</name>
                <value>9</value>
            </interrupt>
            <registers>
                <register>
                    <name>PRL</name>
                    <displayName>PRL</displayName>
                    <description>Lower part of the prescaler</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PR</name>
                            <description>Lower part of the prescaler</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PRH</name>
                    <displayName>PRH</displayName>
                    <description>Higher part of the prescaler</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PR</name>
                            <description>Higher part of the prescaler</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTR</name>
                    <displayName>CTR</displayName>
                    <description>I2C Control Register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>EN_INT</name>
                            <description>Enables the interrupt generated by the I2C</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EN_I2C</name>
                            <description>Enables I2C operation</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXD</name>
                    <displayName>RXD</displayName>
                    <description>Received Data Register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>RXD</name>
                            <description>The last received byte</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STA</name>
                    <displayName>STA</displayName>
                    <description>Status Register</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>INT</name>
                            <description>Interrupt flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>No_Int</name>
                                    <description>Selects ACLK as the clock source</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Int_Present</name>
                                    <description>There is an interrupt. Either a byte has been transmitted
                                    or the arbitration has been lost</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TR_PROG</name>
                            <description>The state of the transmission</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Completed</name>
                                    <description>Data transmission is completed</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>In Progress</name>
                                    <description>Data transmission is in progress</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LOST_ARB</name>
                            <description>The loss of the arbitration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ARB_Present</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ARB_Lost</name>
                                    <description>The arbitration has been lost. Stop bit has been received without initialization or
                                    SDA must be set as high but it is low</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BUSY</name>
                            <description>The state of the I2C bus</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Stop_Bit_Received</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Start_Bit_Received</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RX_ACK</name>
                            <description>Signals if ACK or NACK has been received from a Slave</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ACK_Received</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NACK_Received</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXD</name>
                    <displayName>TXD</displayName>
                    <description>Data for Transmission Register</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>TXD</name>
                            <description>Byte to be transmitted via I2C. When address is transmitted zero nit sets the mode^
                            0 - write in a Salve, 1 - read out of a Slave</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMD</name>
                    <displayName>CMD</displayName>
                    <description>I2C Control Register</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CLR_INT</name>
                            <description>A write as "1" clears the interrupt</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>Sends ACK</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Send_ACK</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Send_NACK</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>WR</name>
                            <description>Writes into the slave device</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RD</name>
                            <description>Reads the data of the slave device</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STOP</name>
                            <description>Sends the stop bit</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>START</name>
                            <description>Sends the start bit</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
