alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/SVD/MDR32VF0xI/MDR1206/MDR1206FI.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>WWDG</name>
            <description>WWDG</description>
            <groupName>WWDG</groupName>
            <baseAddress>0x50048000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>WWDG_IRQ</name>
                <value>5</value>
            </interrupt>
            <registers>
                <register>
                    <name>CR</name>
                    <displayName>CR</displayName>
                    <description>WWDG Control Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>T</name>
                            <description>The value of the 7-bit counter</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>WDGA</name>
                            <description>WWDG Activation Bit</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFR</name>
                    <displayName>CFR</displayName>
                    <description>WWDG Configuration Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>W</name>
                            <description>Window-value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>WGTB</name>
                            <description>Watchdog Timer frequency divisor</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>(WDG_CLK/4096)/1</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>(WDG_CLK/4096)/2</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>(WDG_CLK/4096)/4</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>(WDG_CLK/4096)/8</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EWI</name>
                            <description>Early Wakeup Interrupt</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SR</name>
                    <displayName>SR</displayName>
                    <description>WWDG Status Register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>EWIF</name>
                            <description>Early Wakeup Interrupt Flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WDG_WEC</name>
                            <description>Signals that writing into WDG_WEC WWDG_CR and WWDG_CFR has been completed</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>IWDG</name>
            <description>IWDG Controller</description>
            <groupName>IWDG</groupName>
            <baseAddress>0x50050000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>KR</name>
                    <displayName>KR</displayName>
                    <description>IWDG Key Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>KEY</name>
                            <description>Key value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PR</name>
                    <displayName>PR</displayName>
                    <description>IWDG Prescaler Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PR</name>
                            <description>Prescaler</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LSI_4</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSI_8</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSI_16</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSI_32</name>
                                    <value>0x3</value>
                                    <name>LSI_64</name>
                                    <value>0x4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSI_128</name>
                                    <value>0x5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSI_256</name>
                                    <value>0x6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSI_256_EXTRA</name>
                                    <value>0x7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RLR</name>
                    <displayName>RLR</displayName>
                    <description>IWDG Reload Register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RLR</name>
                            <description>Reload Value Register</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SR</name>
                    <displayName>SR</displayName>
                    <description>IWDG Status Register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PVU</name>
                            <description>IWDG prescaler value update</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RVU</name>
                            <description>IWDG counter reload value update</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
