alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/SVD/MDR32VF0xI/MDR1206/MDR1206FI.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>POWER</name>
            <description>Power Detector</description>
            <groupName>POWER</groupName>
            <baseAddress>0x50058000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>POWER_IRQ</name>
                <value>4</value>
            </interrupt>
            <registers>
                <register>
                    <name>PVDCS</name>
                    <displayName>PVDCS</displayName>
                    <description>Power Detector Control and Status Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PVDBEN</name>
                            <description>Enables Battery PVD</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PVDEN</name>
                            <description>Enables Ucc and OverVoltage PVD</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLSB</name>
                            <description>Selects UccB comparison value</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>3</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>greater than 1.8V</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>greater than 2.0V</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>greater than 2.2V</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>greater than 2.4V</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>greater than 2.6V</name>
                                    <value>0x4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>greater than 2.8V</name>
                                    <value>0x5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>greater than 3.0V </name>
                                    <value>0x6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>greater than 3.2V</name>
                                    <value>0x7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PLS</name>
                            <description>Selects Ucc comparison value</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>3</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>greater than 2.3V</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>greater than 2.4V</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>greater than 2.5V</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>greater than 2.6V</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>greater than 2.7V</name>
                                    <value>0x4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>greater than 2.8V</name>
                                    <value>0x5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>greater than 2.9V </name>
                                    <value>0x6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>greater than 3.0V</name>
                                    <value>0x7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PVDB</name>
                            <description>The result of the comparison for UccB</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>UccB_less</name>
                                    <description>UccB is less than the PLSB value</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UccB_exc</name>
                                    <description>UccB exceeds the PLSB value</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PVD</name>
                            <description>The result of the comparison for Ucc</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Ucc_less</name>
                                    <description>Ucc is less than PLS value</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Ucc_esc</name>
                                    <description>Ucc exceeds PLS value</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IEPVDB</name>
                            <description>PVDB Interrupt Flag</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IEPVD</name>
                            <description>PVD Interrupt Flag</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INV</name>
                            <description>Inversion of PVD</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INVB</name>
                            <description>Inversion of PVDB</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
