alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/SVD/MDR32VF0xI/MDR1206/MDR1206FI.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>BKP</name>
            <description>Backup domain</description>
            <groupName>BKP</groupName>
            <baseAddress>0x50060000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>BKP_IRQ</name>
                <value>10</value>
            </interrupt>
            <registers>
                <register>
                    <name>WPR</name>
                    <displayName>WPR</displayName>
                    <description>Key Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>LDO</name>
                    <displayName>LDO</displayName>
                    <description>LDO Control Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>BLDO_TRIM</name>
                            <description>Backup domain LDO trimming</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>BLDO_BOOST</name>
                            <description>Enables Boost mode of BLDO</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Typical value</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BLDO trimming is enabled</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LDO_BOOST</name>
                            <description>Enables Boost mode of LDO</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SW_CNTRL</name>
                            <description>Enables SW control</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>JTAG_ON</name>
                            <description>Enables JTAG operation</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WAKEUP1</name>
                            <description>WAKEUP1 state</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WAKEUP2</name>
                            <description>WAKEUP2 state</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WAKEUP3</name>
                            <description>WAKEUP3 state</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FPOR</name>
                            <description>POR Trigger Flag</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMPF</name>
                            <description>Signals if there was a break-in</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MODE</name>
                            <description>Operating Mode</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SW_OFF</name>
                            <description>Write "1" to switch off battery backup</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLK</name>
                    <displayName>CLK</displayName>
                    <description>Clock Register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>LSE_ON</name>
                            <description>Enables LSE</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSE_BYP</name>
                            <description>Enables bypass mode of LSE</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSE_RDY</name>
                            <description>Signals if LSE is ready</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LSE_CONF</name>
                            <description>LSE Configuration Register</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Default Mode</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Glitch filter is on</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Booster current is increased</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Booster current is increased and glitch filter is on</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LSI_ON</name>
                            <description>Enables LSI</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSI_RDY</name>
                            <description>Signals if LSI is ready</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HSI_ON</name>
                            <description>Enables HSI</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSI_RDY</name>
                            <description>Signals if HSI is ready</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HSI_LSI_TRIM</name>
                            <description>HSI and LSI trimming value</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CR</name>
                    <displayName>RTC_CR</displayName>
                    <description>RTC Control Register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RTC_SEL</name>
                            <description>Selects RTC source</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LSI</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSE</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSI_RTC</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSE_RTC</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RTC_EN</name>
                            <description>Enables RTC operation</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_CAL</name>
                            <description>RTC Clock Calibration</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>RTC_RESET</name>
                            <description>Resets RTC</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WUCK_SEL_LOW</name>
                            <description>Selects independent clock for WDG (WUCK_SEL[1:0])</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>BY 16</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BY 8</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BY 4</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BY 2</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>WUCK_SEL_HIGH</name>
                            <description>Selects clocking for WDT</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Independent</name>
                                    <description>Independent clocking from WUCK_SEL[1:0]</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Common</name>
                                     <description>Common clocking with the counter/calendar</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FMT</name>
                            <description>Format</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>24 hours</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>AM/PM</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_WUTR</name>
                    <displayName>RTC_WUTR</displayName>
                    <description>WDG Counter Register</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RTC_PREDIV_S</name>
                    <displayName>RTC_PREDIV_S</displayName>
                    <description>Counter/Calendar Preliminary Divisor Register</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RTC_DIV</name>
                            <description>Counter/Calendar divisor</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_PRL</name>
                    <displayName>RTC_PRL</displayName>
                    <description>RTC Prescaler Register</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RTC_PRL</name>
                            <description>RTC prescaler</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_ALRM</name>
                    <displayName>RTC_ALRM</displayName>
                    <description>RTC Alarm Register</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>RTC_CS</name>
                    <displayName>RTC_CS</displayName>
                    <description>RTC Control and Status Register</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>OWF</name>
                            <description>Overflow of BKP_RTC_WUT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SECF</name>
                            <description>Siganls if the values of BKP_RTC_PREDIV_S and BKP_RTC_PRL coincide</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WUTF</name>
                            <description>Signals if BKP_RTC_WUTR is greater than BKP_RTC_ALRM</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OWF_IE</name>
                            <description>Enables OWF interrupt</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SECF_IE</name>
                            <description>Enables SECF interrup</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WUTF_IE</name>
                            <description>Enables WUTF interrup</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WEC</name>
                            <description>WEC description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ALRA_EN</name>
                            <description>Enables event A (coincidence of BKP_RTC_ALRMAR and running time)</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALRB_EN</name>
                            <description>Enables event B (coincidence of BKP_RTC_ALRMBR and running time)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALRAF</name>
                            <description>Event A Flag</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALRBF</name>
                            <description>Event B Flag</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALRAF_IE</name>
                            <description>ALRAF Interrupt Enable</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALRBF_IE</name>
                            <description>ALRBF Interrupt Enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSF</name>
                            <description>Time Stamp Flag</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
