alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/SVD/MDR32VF0xI/MDR1206/MDR1206FI.svd
                <register>
                    <name>RTC_TR</name>
                    <displayName>RTC_TR</displayName>
                    <description>Counter/Calendar Time Register (BCD format)</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>SU</name>
                            <description>The units of seconds (BCD format)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ST</name>
                            <description>The tens of seconds (BCD format)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MNU</name>
                            <description>The units of minutes (BCD format)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>MNT</name>
                            <description>The tens of minutes (BCD format)</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>HU</name>
                            <description>The units of hours (BCD format)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>HT</name>
                            <description>The tens of hours (BCD format)</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PM</name>
                            <description>AM/PM value</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_DR</name>
                    <displayName>RTC_DR</displayName>
                    <description>Counter/Calendar Data Register (BCD format)</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DU</name>
                            <description>The units of the date (BCD format)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DT</name>
                            <description>The tens of the date (BCD format)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MU</name>
                            <description>The units of the month (BCD format)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>MT</name>
                            <description>The tens of the month (BCD format)</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WDU</name>
                            <description>A weekday</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>3</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Not used</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Monday</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Tuesday</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Wednesday</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Thursday</name>
                                    <value>0x4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Friday</name>
                                    <value>0x5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Saturday</name>
                                    <value>0x6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Sunday</name>
                                    <value>0x7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>YU</name>
                            <description>The units of the years (BCD format)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>YT</name>
                            <description>The tens of the years (BCD format)</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_ALRMAR</name>
                    <displayName>RTC_ALRMAR</displayName>
                    <description>Settings of the alarm A</description>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>SU</name>
                            <description>Units of seconds in BCD-format</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ST</name>
                            <description>Tens of seconds in BCD-format</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MSK1</name>
                            <description>A mask for seconds</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                  <enumeratedValue>
                                    <name>SEC</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NO_SEC</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MNU</name>
                            <description>Units of minutes in BCD-format</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>MNT</name>
                            <description>Tens of minutes in BCD-format</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MSK2</name>
                            <description>A mask for minutes</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                  <enumeratedValue>
                                    <name>MIN</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NO_MIN</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>HU</name>
                            <description>Units of hours in BCD-format</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>HT</name>
                            <description>Tens of hours in BCD-format</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PM</name>
                            <description>AM/PM setting</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                  <enumeratedValue>
                                    <name>AM or 24-hour clock</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PM</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MSK3</name>
                            <description>A mask for hours</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                  <enumeratedValue>
                                    <name>HOURS</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NO_HOURS</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DU</name>
                            <description>Units of a date in BCD-format</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DT</name>
                            <description>Tens of a date in BCD-format</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>WDSEL</name>
                            <description>Day or date selection</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                  <enumeratedValue>
                                    <name>Date</name>
                                    <description>DU[3:0], DT[1:0]</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Day of the week</name>
                                    <description>DU[3:0] defines the day of the week</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MSK4</name>
                            <description>A maks for the date</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                  <enumeratedValue>
                                    <name>Date</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NO_DATE</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="RTC_ALRMAR">
                    <name>RTC_ALRMBR</name>
                    <displayName>RTC_ALRMBR</displayName>
                    <description>Settings of the alarm B</description>
                    <addressOffset>0x00000030</addressOffset>
                </register>
                <register derivedFrom="RTC_TR">
                    <name>RTC_TSTR1</name>
                    <displayName>RTC_TSTR1</displayName>
                    <description>Time of an external intrusion</description>
                    <addressOffset>0x00000034</addressOffset>
                    <access>read-only</access>
                </register>
                <register derivedFrom="RTC_TR">
                    <name>RTC_TSTR2</name>
                    <displayName>RTC_TSTR2</displayName>
                    <description>Time of an xternal intrusion</description>
                    <addressOffset>0x00000038</addressOffset>
                    <access>read-only</access>
                </register>
                <register derivedFrom="RTC_TR">
                    <name>RTC_TSTR3</name>
                    <displayName>RTC_TSTR3</displayName>
                    <description>Time of an external Intrusion</description>
                    <addressOffset>0x0000003C</addressOffset>
                    <access>read-only</access>
                </register>
