alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/SVD/MDR32VF0xI/MDR1206/MDR1206FI.svd
                <register>
                    <name>RTC_TMPCAL3</name>
                    <displayName>RTC_TMPCAL3</displayName>
                    <description>Calibration and Thermocompensation Unit Control Register 3</description>
                    <addressOffset>0x00000058</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>SWCTR_INV</name>
                            <description>Inversion of control logic for the SW (open drain)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>HZ_into_0</name>
                                    <description>when SW_PWR = 1</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0_into_HZ</name>
                                    <description>when SW_PWR = 1</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BLDO_TRIM_B2</name>
                            <description>always write as zero</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSE_CONF_B2</name>
                            <description>always write as zero</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TEMP_EN</name>
                            <description>Enables the thermosensor</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CONST12_HIGH</name>
                            <description>High-order bit of the calibration constant for code 12 of the thermosensor</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CONST13</name>
                            <description>Calibration constant for code 13 of the thermosensor</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST14</name>
                            <description>Calibration constant for code 14 of the thermosensor</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST15</name>
                            <description>Calibration constant for code 15 of the thermosensor</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>TEMP_RESULT</name>
                            <description>Thermosensor result</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TEMP_RESULT_RDY</name>
                            <description>Signals readiness of TEMP_RESULT[3:0]</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INVALID</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>VALID</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>ADCUI</name>
            <description>ADCUI CONTROLLER</description>
            <groupName>ADCUI</groupName>
            <baseAddress>0x50068000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>ADCUI_F03_IRQn</name>
                <value>14</value>
            </interrupt>
            <interrupt>
                <name>ADCUI_F1_IRQn</name>
                <value>15</value>
            </interrupt>
            <interrupt>
                <name>ADCUI_F2_IRQn</name>
                <value>16</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTRL1</name>
                    <displayName>CTRL1</displayName>
                    <description>Control Register 1</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>OSR_CONF</name>
                            <description>Oversample rate</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1024</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>512</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>256</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>tst_in_high</name>
                            <description>Test. Always write as zero</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RESET_DIG</name>
                            <description>Resets the digital units of ADCUI</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_RESET</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESET</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ZXRMS</name>
                            <description>Updating of the RMS registers</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>tst_in_low</name>
                            <description>Test. Always write as zero</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>VREF_SEL</name>
                            <description>Reference voltage selection</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>EXT</name>
                                    <description>Voltage from VREF input</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT</name>
                                    <description>Internal reference voltage 2.4V</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FREQSEL</name>
                            <description>Calculation of the period lenght in the V-channels</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STORE</name>
                                    <description>The last calculated value is stored</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CALC_EN</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>VANOLOAD</name>
                            <description>"Without load" mode when total energy is calculated</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>VARNOLOAD</name>
                            <description>"Without load" mode when reactive-phase energy is calculated</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>APNOLOAD</name>
                            <description>"Without load" mode when active energy is calculated</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PER_LENGTH</name>
                            <description>The range of the period and phase shift calculation</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>ZXLPF</name>
                            <description>Disabling of the LPF before cross-zero detector in the V-channels</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LPF_ON</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LPF_OFF</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESOL</name>
                            <description>OUTPUT_MODE</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>16_BITS</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>24_BITS</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>I3EN</name>
                            <description>Enables channel I3</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>V2EN</name>
                            <description>Enables channel V2</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2EN</name>
                            <description>Enables channel I2</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>V1EN</name>
                            <description>Enables channel V1</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I1EN</name>
                            <description>Enables channel I1</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>V0EN</name>
                            <description>Enables channel V0</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I0EN</name>
                            <description>Enables channel I0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL2</name>
                    <displayName>CTRL2</displayName>
                    <description>Control Register 2</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DCHPENI3</name>
                            <description>Enables chopper for channel I3</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DCHPENI2</name>
                            <description>Enables chopper for channel I2</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DCHPENI1</name>
                            <description>Enables chopper for channel I1</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DCHPENI0</name>
                            <description>Enables chopper for channel I0</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DCHPENV2</name>
                            <description>Enables chopper for channel V2</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DCHPENV1</name>
                            <description>Enables chopper for channel V1</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DCHPENV0</name>
                            <description>Enables chopper for channel V0</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SAGCYC</name>
                            <description>The number of half-cycles of U for voltage slump calculation</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SAGLVL</name>
                            <description>The allowed voltage slump level</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL3</name>
                    <displayName>CTRL3</displayName>
                    <description>Control Register 3</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>ZXTOUT</name>
                            <description>Time in clock cycles when there was no zero crossing</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
