alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/SVD/MDR32VF0xI/MDR1206/MDR1206FI.svd
                <register>
                    <name>F0VPEAK</name>
                    <displayName>F0VPEAK</displayName>
                    <description>V peak value in F0</description>
                    <addressOffset>0x00000038</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0VPEAK</name>
                            <description>V peak value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0IPEAK</name>
                    <displayName>F0IPEAK</displayName>
                    <description>I peak value in F0</description>
                    <addressOffset>0x0000003C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0IPEAK</name>
                            <description>I peak value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0VDAT</name>
                    <displayName>F0VDAT</displayName>
                    <description>FIFO for V-channel samples in F0</description>
                    <addressOffset>0x00000040</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0VDAT</name>
                            <description>V or a P samples FIFO</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0I0DAT</name>
                    <displayName>F0I0DAT</displayName>
                    <description>I0 samples FIFO in F0</description>
                    <addressOffset>0x00000044</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0I0DAT</name>
                            <description>I0 or a P samples FIFO</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0I3DAT</name>
                    <displayName>F0I3DAT</displayName>
                    <description>I3 samples FIFO in F0</description>
                    <addressOffset>0x00000048</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0I3DAT</name>
                            <description>I3 samples FIFO</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0VRMS</name>
                    <displayName>F0VRMS</displayName>
                    <description>V RMS in F0</description>
                    <addressOffset>0x0000004C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0VRMS</name>
                            <description>V RMS</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0VRMS2</name>
                    <displayName>F0VRMS2</displayName>
                    <description>V RMS squared in F0</description>
                    <addressOffset>0x00000050</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>F0IRMS</name>
                    <displayName>F0IRMS</displayName>
                    <description>I RMS in F0</description>
                    <addressOffset>0x00000054</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0IRMS</name>
                            <description>I RMS in F0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0IRMS2</name>
                    <displayName>F0IRMS2</displayName>
                    <description>I RMS squared in F0</description>
                    <addressOffset>0x00000058</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>F0STAT</name>
                    <displayName>F0STAT</displayName>
                    <description>F0 Status Register</description>
                    <addressOffset>0x0000005C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0VAROVN</name>
                            <description>Overflow of the negative reactive energy accumulator register.
                            Write as "1" resets this flag</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F0WATTOVN</name>
                            <description>Overflow of the negative active energy accumulator register.
                             Write as "1" resets this flag</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>C3IF_OVR</name>
                            <description>Overflow of FIFO F0I3DAT</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>C3IF_FLL</name>
                            <description>FIFO F0I3DAT is full</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>C3IF_EMP</name>
                            <description>FIFO F0I3DAT is empty</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F0ZEROCRS</name>
                            <description>Zero-crossing in V-channel.
                             Write "1" resets this flag</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F0VANLDFL</name>
                            <description>Full power is less than the comparison level</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F0VARNLDFL</name>
                            <description>Reactive power is less than the comparison level</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F0VARSIGN</name>
                            <description>Reactive power has changed its sign.
                             Write as "1" resets this flag</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F0APNLDFL</name>
                            <description>Active power is less than the comparison level</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F0APSIGN</name>
                            <description>Active power has changed its sign.
                             Write as "1" resets this flag</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F0ICHANNEL</name>
                            <description>Active I-channel</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>I0</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>I3</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>F0ZXTOF</name>
                            <description>No zero-crossing in V0 during ZXTOUT. 
                             Write as "1" resets this flag</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F0VAOV</name>
                            <description>Overflow of the full energy accumulator register.
                             Write as "1" resets this flag</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F0VAROVP</name>
                            <description>Overflow of the positive reactive energy accumulator register.
                             Write as "1" resets this flag</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F0WATTOVP</name>
                            <description>Overflow of the positive active energy accumulator register.
                             Write as "1" resets this flag</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F0PEAKIF</name>
                            <description>Excess of I threshold.
                             Write as "1" resets this flag</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F0PEAKVF</name>
                            <description>Excess of V threshold.
                             Write as "1" resets this flag</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F0SAGF</name>
                            <description>Voltage sag (ADCUI_CTRL2[15:0]) has occurred.
                             Write as "1" resets this flag</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F0IF_OVR</name>
                            <description>Overflow of FIFO F0IDAT.
                             Write as "1" resets this flag</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F0IF_FLL</name>
                            <description>FIFO F0IDAT is full</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F0IF_EMP</name>
                            <description>FIFO F0IDAT is empty</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F0VF_OVR</name>
                            <description>Overflow of FIFO F0VDAT.
                             Write as "1" resets this flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F0VF_FLL</name>
                            <description>FIFO F0VDAT is full</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F0VF_EMP</name>
                            <description>FIFO F0VDAT is empty</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
