alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/SVD/MDR32VF0xI/MDR1206/MDR1206FI.svd
                <register>
                    <name>F2MD0</name>
                    <displayName>F2MD0</displayName>
                    <description>Parameters 0 for F2</description>
                    <addressOffset>0x000000E0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2PER_FREQ</name>
                            <description>Period length of the input signal in the V2-channel</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>21</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>V2GAIN</name>
                            <description>Digital gain in V2</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_GAIN</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>6dB</name>
                                    <description>Shifts the result by 1 to the left</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>I2GAIN</name>
                            <description>Digital gain in I2</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_GAIN</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>6dB</name>
                                    <description>Shifts the result by 1 to the left</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>F2REACTS</name>
                            <description>The sign of the reactive energy in the last period</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F2ACTS</name>
                            <description>The sign of the active energy in the last period</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F2ISEL</name>
                            <description>Data for the FIFO of the I2 channel</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>I_SAMPLES</name>
                                    <description>Before or after HPF. See F2ISEL_HPF</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ACTIVE_POWER_SAMPLES</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REACTIVE_POWER_SAMPLES</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FULL_POWER_SAMPLES</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>F2VSEL</name>
                            <description>Data for the FIFO of the V2 channel</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>V_SAMPLES</name>
                                    <description>Before HPF</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ACTIVE_POWER_SAMPLES</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REACTIVE_POWER_SAMPLES</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>V_HPF_SAMPLES</name>
                                    <description>After HPF</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2MD1</name>
                    <displayName>F2MD1</displayName>
                    <description>Parameters 1 for F2</description>
                    <addressOffset>0x000000E4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VPKLVL</name>
                            <description>V peak value</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>F2IPKLVL</name>
                            <description>I peak value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2MD2</name>
                    <displayName>F2MD2</displayName>
                    <description>Parameters 2 of F2</description>
                    <addressOffset>0x000000E8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2PHASE</name>
                            <description>Phase shift of V2 in regard to V0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>17</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2VPEAK</name>
                    <displayName>F2VPEAK</displayName>
                    <description>V peak value in F2</description>
                    <addressOffset>0x000000EC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VPEAK</name>
                            <description>Voltage peak value. A "read" resets the value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2IPEAK</name>
                    <displayName>F2IPEAK</displayName>
                    <description>I peak value in F2</description>
                    <addressOffset>0x000000F0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2IPEAK</name>
                            <description>Current peak value. A "read" resets the value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2VDAT</name>
                    <displayName>F2VDAT</displayName>
                    <description>FIFO for V-channel samples in F2</description>
                    <addressOffset>0x000000F4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VDAT</name>
                            <description>V or a P samples FIFO</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2IDAT</name>
                    <displayName>F2IDAT</displayName>
                    <description>I samples FIFO in F2</description>
                    <addressOffset>0x000000F8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2IDAT</name>
                            <description>I or a P samples FIFO</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2VRMS</name>
                    <displayName>F2VRMS</displayName>
                    <description>V RMS in F2</description>
                    <addressOffset>0x000000FC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VRMS</name>
                            <description>V RMS</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2VRMS2</name>
                    <displayName>F2VRMS2</displayName>
                    <description>V RMS squared in F2</description>
                    <addressOffset>0x00000100</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>F2IRMS</name>
                    <displayName>F2IRMS</displayName>
                    <description>I RMS in F2</description>
                    <addressOffset>0x00000104</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2IRMS</name>
                            <description>I RMS</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2IRMS2</name>
                    <displayName>F2IRMS2</displayName>
                    <description>I RMS squared in F2</description>
                    <addressOffset>0x00000108</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>F2STAT</name>
                    <displayName>F2STAT</displayName>
                    <description>F2 Status Register</description>
                    <addressOffset>0x0000010C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VAROVN</name>
                            <description>Overflow of the negative reactive energy accumulator register.
                             Write as "1" resets this flag</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2WATTOVN</name>
                            <description>Overflow of the negative active energy accumulator register. 
                             Write as "1" resets this flag</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2ZEROCRS</name>
                            <description>Zero-crossing in V-channel.
                             Write "1" resets this flag</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VANLDFL</name>
                            <description>Full power is less than the comparison level</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F2VARNLDFL</name>
                            <description>Reactive power is less than the comparison level</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F2VARSIGN</name>
                            <description>Reactive power has changed its sign.
                             Write as "1" resets this flag</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2APNLDFL</name>
                            <description>Active power is less than the comparison level</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F2APSIGN</name>
                            <description>Active power has changed its sign.
                             Write as "1" resets this flag</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2ZXTOF</name>
                            <description>No zero-crossing in V2 during ZXTOUT. 
                             Write as "1" resets this flag</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VAOV</name>
                            <description>Overflow of the full energy accumulator register.
                             Write as "1" resets this flag</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VAROVP</name>
                            <description>Overflow of the positive reactive energy accumulator register.
                             Write as "1" resets this flag</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2WATTOVP</name>
                            <description>Overflow of the positive active energy accumulator register.
                             Write as "1" resets this flag</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2PEAKIF</name>
                            <description>Excess of I threshold.
                             Write as "1" resets this flag</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2PEAKVF</name>
                            <description>Excess of V threshold.
                             Write as "1" resets this flag</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2SAGF</name>
                            <description>Voltage sag has occurred.
                             Write as "1" resets this flag</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2IF_OVR</name>
                            <description>Overflow of FIFO F2IDAT.
                             Write as "1" resets this flag</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2IF_FLL</name>
                            <description>FIFO F2DAT is full</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F2IF_EMP</name>
                            <description>FIFO F2IDAT is empty</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F2VF_OVR</name>
                            <description>Overflow of FIFO F2VDAT.
                             Write as "1" resets this flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VF_FLL</name>
                            <description>FIFO F2VDAT is full</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F2VF_EMP</name>
                            <description>FIFO F2VDAT is empty</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
