alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/SVD/MDR32VF0xI/MDR1206/MDR1206FI.svd
                <register>
                    <name>F2MASK</name>
                    <displayName>F2MASK</displayName>
                    <description>Mask for interrupts in F2</description>
                    <addressOffset>0x00000110</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VAROVNM</name>
                            <description>MASK: Overflow of the negative reactive energy accumulator</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2WATTOVNM</name>
                            <description>MASK: Overflow of the negative active energy accumulator</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2ZEROCRSM</name>
                            <description>MASK: Zero-crossing in V-channel</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VANLDFLM</name>
                            <description>MASK: Full power is less than the comparison level</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VARNLDFLM</name>
                            <description>MASK: Reactive power is less than the comparison level</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VARSIGNM</name>
                            <description>MASK: Reactive power has changed its sign</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2APNLDFLM</name>
                            <description>MASK: Active power is less than the comparison level</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2APSIGNM</name>
                            <description>MASK: Active power has changed its sign</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2ZXTOFM</name>
                            <description>MASK: No zero-crossing in V2 during ZXTOUT</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VAOVM</name>
                            <description>MASK: Overflow of the full energy accumulator register</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VAROVPM</name>
                            <description>MASK: Overflow of the positive reactive energy accumulator register</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2WATTOVPM</name>
                            <description>MASK: Overflow of the positive active energy accumulator register</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2PEAKIFM</name>
                            <description>MASK: Excess of I threshold</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2PEAKVFM</name>
                            <description>MASK: Excess of V threshold</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2SAGFM</name>
                            <description>MASK: Voltage sag has occurred</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2IF_OVRM</name>
                            <description>MASK: Overflow of FIFO F2IDAT</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2IF_FLLM</name>
                            <description>MASK: FIFO F2DAT is full</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2IF_EMPM</name>
                            <description>MASK: FIFO F2IDAT is empty</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VF_OVRM</name>
                            <description>MASK: Overflow of FIFO F1IDAT</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VF_FLLM</name>
                            <description>MASK: FIFO F2VDAT is full</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2VF_EMPM</name>
                            <description>MASK: FIFO F2VDAT is empty</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCAL1</name>
                    <displayName>CCAL1</displayName>
                    <description>I0 and V0 Calibration Register</description>
                    <addressOffset>0x00000114</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>I0BGAIN</name>
                            <description>Calibration coefficient for I0</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>V0BGAIN</name>
                            <description>Calibration coefficient for V0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCAL2</name>
                    <displayName>CCAL2</displayName>
                    <description>I1 and V1 Calibration Register</description>
                    <addressOffset>0x00000118</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>I1BGAIN</name>
                            <description>Calibration coefficient for I1</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>V1BGAIN</name>
                            <description>Calibration coefficient for V1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCAL3</name>
                    <displayName>CCAL3</displayName>
                    <description>I2 and V2 Calibration Register</description>
                    <addressOffset>0x0000011C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>I2BGAIN</name>
                            <description>Calibration coefficient for I2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>V2BGAIN</name>
                            <description>Calibration coefficient for V2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCAL4</name>
                    <displayName>CCAL4</displayName>
                    <description>I3 Calibration Register</description>
                    <addressOffset>0x00000120</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>I3BGAIN</name>
                            <description>Calibration coefficient for I3</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0IRMS_INACTIVE</name>
                    <displayName>F0IRMS_INACTIVE</displayName>
                    <description>I RMS of an Inactive Channel F0</description>
                    <addressOffset>0x00000124</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0IRMS_INACTIVE</name>
                            <description>I RMS of an inactive channel</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0WATTP_L</name>
                    <displayName>F0WATTP_L</displayName>
                    <description>Lower Part of the Positive Active Energy Accumulator in F0</description>
                    <addressOffset>0x00000128</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0WATTHRP_L</name>
                            <description>Read after the upper part has been read</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0WATTN_L</name>
                    <displayName>F0WATTN_L</displayName>
                    <description>Lower Part of the Negative Active Energy Accumulator in F0</description>
                    <addressOffset>0x0000012C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0WATTHRN_L</name>
                            <description>Read after the upper part has been read</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0VARP_L</name>
                    <displayName>F0VARP_L</displayName>
                    <description>Lower Part of the Positive Reactive Energy Accumulator in F0</description>
                    <addressOffset>0x00000130</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0VARHRP_L</name>
                            <description>Read after the upper part has been read</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0VARN_L</name>
                    <displayName>F0VARN_L</displayName>
                    <description>Lower Part of the Negative Reactive Energy Accumulator in F0</description>
                    <addressOffset>0x00000134</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0VARHRN_L</name>
                            <description>Read after the upper part has been read</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0VR_L</name>
                    <displayName>F0VR_L</displayName>
                    <description>Lower Part of the Full Energy Accumulator in F0</description>
                    <addressOffset>0x00000138</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0VAHR_L</name>
                            <description>Read after the upper part has been read</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1WATTP_L</name>
                    <displayName>F1WATTP_L</displayName>
                    <description>Lower Part of the Positive Active Energy Accumulator in F1</description>
                    <addressOffset>0x0000013C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1WATTHRP_L</name>
                            <description>Read after the upper part has been read</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1WATTN_L</name>
                    <displayName>F1WATTN_L</displayName>
                    <description>Lower Part of the Negative Active Energy Accumulator in F1</description>
                    <addressOffset>0x00000140</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1WATTHRN_L</name>
                            <description>Read after the upper part has been read</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1VARP_L</name>
                    <displayName>F1VARP_L</displayName>
                    <description>Lower Part of the Positive Reactive Energy Accumulator in F1</description>
                    <addressOffset>0x00000144</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1VARHRP_L</name>
                            <description>Read after the upper part has been read</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1VARN_L</name>
                    <displayName>F1VARN_L</displayName>
                    <description>Lower Part of the Negative Reactive Energy Accumulator in F1</description>
                    <addressOffset>0x00000148</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1VARHRN_L</name>
                            <description>Read after the upper part has been read</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1VR_L</name>
                    <displayName>F1VR_L</displayName>
                    <description>Lower Part of the Full Energy in F1</description>
                    <addressOffset>0x0000014C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1VAHR_L</name>
                            <description>Read after the upper part has been read</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2WATTP_L</name>
                    <displayName>F2WATTP_L</displayName>
                    <description>Lower Part of the Positive Active Energy Accumulator in F2</description>
                    <addressOffset>0x00000150</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2WATTHRP_L</name>
                            <description>Read after the upper part has been read</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2WATTN_L</name>
                    <displayName>F2WATTN_L</displayName>
                    <description>Lower Part of the Negative Active Energy Accumulator in F2</description>
                    <addressOffset>0x00000154</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2WATTHRN_L</name>
                            <description>Read after the upper part has been read</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2VARP_L</name>
                    <displayName>F2VARP_L</displayName>
                    <description>Lower Part of the Positive Reactive Energy in F2</description>
                    <addressOffset>0x00000158</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VARHRP_L</name>
                            <description>Read after the upper part has been read</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2VARN_L</name>
                    <displayName>F2VARN_L</displayName>
                    <description>Lower Part of the Negative Reactive Energy in F2</description>
                    <addressOffset>0x0000015C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VARHRN_L</name>
                            <description>Read after the upper part has been read</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
