alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/SVD/MDR32VF0xI/MDR1206/MDR1206FI.svd
                <register>
                    <name>F2VR_L</name>
                    <displayName>F2VR_L</displayName>
                    <description>Lower Part of the Full Energy in F2</description>
                    <addressOffset>0x00000160</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VAHR_L</name>
                            <description>Read after the upper part has been read</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LOAD</name>
                    <displayName>LOAD</displayName>
                    <description>Control of an Unload Mode</description>
                    <addressOffset>0x00000164</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>VANOLOAD</name>
                            <description>An Unload Mode for the full energy calculation</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>VARNOLOAD</name>
                            <description>An Unload Mode for the reactive energy calculation</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>APNOLOAD</name>
                            <description>An Unload Mode for the active energy calculation</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0VRMS_TRUE</name>
                    <displayName>F0VRMS_TRUE</displayName>
                    <description>An Effective Value of V over a Period in F0</description>
                    <addressOffset>0x00000168</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0VRMS_TRUE</name>
                            <description>The value is renewed at V zero-crossing</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>29</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1VRMS_TRUE</name>
                    <displayName>F1VRMS_TRUE</displayName>
                    <description>An Effective Value of V over a Period in F1</description>
                    <addressOffset>0x0000016C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1VRMS_TRUE</name>
                            <description>The value is renewed at V zero-crossing</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>29</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2VRMS_TRUE</name>
                    <displayName>F2VRMS_TRUE</displayName>
                    <description>An Effective Value of V over a Period in F2</description>
                    <addressOffset>0x00000170</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VRMS_TRUE</name>
                            <description>The value is renewed at V zero-crossing</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>29</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSC</name>
                    <displayName>MSC</displayName>
                    <description>DMA Requests and Other Settings</description>
                    <addressOffset>0x00000174</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DMA_EN_RQ_B_1</name>
                            <description>Allows channel 1 to make requests to the DMA.
                            Block trasactions</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_B_2</name>
                            <description>Allows channel 2 to make requests to the DMA.
                            Block transactions</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_B_3</name>
                            <description>Allows channel 3 to make requests to the DMA.
                            Block transactions</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_B_4</name>
                            <description>Allows channel 4 to make requests to the DMA.
                            Block transactions</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_B_5</name>
                            <description>Allows channel 5 to make requests to the DMA.
                            Block transactions</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_B_6</name>
                            <description>Allows channel 6 to make requests to the DMA.
                            Block transactions</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_B_7</name>
                            <description>Allows channel 7 to make requests to the DMA.
                            Block transactions</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_S_1</name>
                            <description>Allows channel 1 to make requests to the DMA.
                            Single transactions</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_S_2</name>
                            <description>Allows channel 2 to make requests to the DMA.
                            Single transactions</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_S_3</name>
                            <description>Allows channel 3 to make requests to the DMA.
                            Single transactions</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_S_4</name>
                            <description>Allows channel 4 to make requests to the DMA.
                            Single transactions</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_S_5</name>
                            <description>Allows channel 5 to make requests to the DMA.
                            Single transactions</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_S_6</name>
                            <description>Allows channel 6 to make requests to the DMA.
                            Single transactions</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_S_7</name>
                            <description>Allows channel 6 to make requests to the DMA.
                            Single transactions</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F0I3RMSOS</name>
                            <description>Shift calibration for the I3 RMS calculator</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>F0ISEL_HPF</name>
                            <description>Data Written in FIFO F0IDAT</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>After HPF</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Before HPF</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>F1ISEL_HPF</name>
                            <description>Data Written in FIFO F1IDAT</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>After HPF</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Before HPF</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>F2ISEL_HPF</name>
                            <description>Data Written in FIFO F2IDAT</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>After HPF</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Before HPF</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>F0VPHASE_LOW</name>
                            <description>F0VPHASE[1:0]</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>F90_CONF</name>
                            <description>Selects V for active and reactive power calculation</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Before HPF</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>After HPF</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FILTERCFG</name>
                    <displayName>FILTERCFG</displayName>
                    <description>Filter configuration Control</description>
                    <addressOffset>0x00000178</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CHPF_COEFF</name>
                            <description>Coefficient for HPF in all channels which defines a cutoff frequency</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>CLRMS_COEFF</name>
                            <description>Coefficient for LPF in the RMS Calculation Units which defines a cutoff frequency</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>CHP_ADC_CFG</name>
                            <description>Chopper period for all the channels</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLKPHASE1</name>
                    <displayName>CLKPHASE1</displayName>
                    <description>Current Channels Phase Shift Control</description>
                    <addressOffset>0x0000017C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>I0PHASE</name>
                            <description>Phase shift in I0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>I1PHASE</name>
                            <description>Phase shift in I1</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>I2PHASE</name>
                            <description>Phase shift in I2</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>CLC_ADC_CFG</name>
                            <description>ADC clock for all the channels</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLKPHASE2</name>
                    <displayName>CLKPHASE2</displayName>
                    <description>I3 Phase Shift Control</description>
                    <addressOffset>0x00000180</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>I3PHASE</name>
                            <description>Phase shift in I3</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
