alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/SVD/MDR32VF0xI/MDR1206/MDR1206FI.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>TIMER1</name>
            <description>General purpose TIMER1</description>
            <groupName>TIMER1</groupName>
            <baseAddress>0x50070000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TIMER1_IRQ</name>
                <value>6</value>
            </interrupt>
            <registers>
                <register>
                    <name>CNT</name>
                    <displayName>CNT</displayName>
                    <description>Counter</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>PSG</name>
                    <displayName>PSG</displayName>
                    <description>Prescaler value. TIM_CLKd = TIM_CLK/(PSG+1)</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                </register>
                <register>
                    <name>ARR</name>
                    <displayName>ARR</displayName>
                    <description>Auto-reload register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CNTRL</name>
                    <displayName>CNTRL</displayName>
                    <description>Control register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CNT_EN</name>
                            <description>Enables operation of the timer</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ARRB_EN</name>
                            <description>Renewal of the ARR</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ARRB_EN_0</name>
                                    <description>ARR is rewritten when there is a write in ARR</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ARRB_EN_1</name>
                                    <description>ARR is rewritten when CNT == ARR</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>WR_CMPL</name>
                            <description>Flag denotes if a new value can be written in CNT, PSG, ARR. 1 - writing is in process</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DIR</name>
                            <description>Direction</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Direct</name>
                                    <description>From 0 to ARR</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Backward</name>
                                    <description>From ARR to 0</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FDTS</name>
                            <description>Clock frequency FDTS</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>TIM_CLK</name>
                                    <description>FDTS = TIM_CLK</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TIM_CLK_2</name>
                                    <description>FDTS = TIM_CLK/2</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TIM_CLK_3</name>
                                    <description>FDTS = TIM_CLK/3</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TIM_CLK_4</name>
                                    <description>FDTS = TIM_CLK/4</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CNT_MODE</name>
                            <description>Counter mode</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MODE_00</name>
                                    <description>Direct when DIR=0, backward when DIR=1</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MODE_01</name>
                                    <description>Bidirectional with automatic change of DIR when CNT == 0 or CNT == ARR</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MODE_10</name>
                                    <description>Direct when DIR=0, backward when DIR=1</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EVNT_SEL</name>
                            <description>Selects a source which triggers events</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Int_CLOCK</name>
                                    <description>TIM_CLKd</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TIM1</name>
                                    <description>CNT == ARR in Timer1</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TIM2</name>
                                    <description>CNT == ARR in Timer2</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TIM3</name>
                                    <description>CNT == ARR in Timer3</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CH1</name>
                                    <description>Rising edge, mode 1</description>
                                    <value>0x4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CH2</name>
                                    <description>Rising edge, mode 1</description>
                                    <value>0x5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CH3</name>
                                    <description>Rising edge, mode 1</description>
                                    <value>0x6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CH4</name>
                                    <description>Rising edge, mode 1</description>
                                    <value>0x7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ETR_POS</name>
                                    <description>Rising edge, mode 2</description>
                                    <value>0x8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ETR_NEG</name>
                                    <description>Falling edge, mode 2</description>
                                    <value>0x9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TIM4</name>
                                    <description>CNT == ARR in Timer4</description>
                                    <value>0xA</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH1_CCR</name>
                    <displayName>CH1_CCR</displayName>
                    <description>Capture/compare register for channel 1</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CH2_CCR</name>
                    <displayName>CH2_CCR</displayName>
                    <description>Capture/compare register for channel 2</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CH3_CCR</name>
                    <displayName>CH3_CCR</displayName>
                    <description>Capture/compare register for channel 3</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CH4_CCR</name>
                    <displayName>CH4_CCR</displayName>
                    <description>Capture/compare register for channel 4</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CH1_CNTRL0</name>
                    <displayName>CH1_CNTRL0</displayName>
                    <description>CH1 control register 0</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CH_FLTR</name>
                            <description>Input filter for the channel</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_FILTER</name>
                                    <description>FS = FDTS</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_1</name>
                                    <description>FS = TIM_CLK, N = 2</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_2</name>
                                    <description>FS = TIM_CLK, N = 4</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_3</name>
                                    <description>FS = TIM_CLK, N = 8</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_4</name>
                                    <description>FS = FDTS/2, N = 6</description>
                                    <value>0x4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_5</name>
                                    <description>FS = FDTS/2, N = 8</description>
                                    <value>0x5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_6</name>
                                    <description>FS = FDTS/4, N = 6</description>
                                    <value>0x6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_7</name>
                                    <description>FS = FDTS/4, N = 8</description>
                                    <value>0x7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_8</name>
                                    <description>FS = FDTS/8, N = 6</description>
                                    <value>0x8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_9</name>
                                    <description>FS = FDTS/8, N = 8</description>
                                    <value>0x9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_10</name>
                                    <description>FS = FDTS/16, N = 5</description>
                                    <value>0xA</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_11</name>
                                    <description>FS = FDTS/16, N = 6</description>
                                    <value>0xB</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_12</name>
                                    <description>FS = FDTS/16, N = 8</description>
                                    <value>0xC</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_13</name>
                                    <description>FS = FDTS/32, N = 5</description>
                                    <value>0xD</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_14</name>
                                    <description>FS = FDTS/32, N = 6</description>
                                    <value>0xE</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_15</name>
                                    <description>FS = FDTS/32, N = 8</description>
                                    <value>0xF</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CH_SEL</name>
                            <description>Selects an event for CHyi to write the CNT value into CHy_CCR</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CH_PSC</name>
                            <description>Prescaler for the input channel</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_DIV</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV_2</name>
                                    <description>Division by 2</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV_4</name>
                                    <description>Division by 4</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV_8</name>
                                    <description>Division by 8</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OCCE</name>
                            <description>Enables ETR</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCCM</name>
                            <description>PWM mode. Generation of REF</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>BRK_EN</name>
                            <description>Enables reset of REF and DTG when BRK=0</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETR_EN</name>
                            <description>Enables reset of REF when ETR=0</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WR_CMPL</name>
                            <description>Flag signals whether a new value can be written in CHy_CCR</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CAP_NPWM</name>
                            <description>Channel operating mode</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PWM</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CAPTURE</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>WR_CMPL1</name>
                            <description>Flag signals whether a new value can be written in CHy_CCR1</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="CH1_CNTRL0">
                    <name>CH2_CNTRL0</name>
                    <displayName>CH2_CNTRL0</displayName>
                    <description>CH2 control register 0</description>
                    <addressOffset>0x00000024</addressOffset>
                </register>
                <register derivedFrom="CH1_CNTRL0">
                    <name>CH3_CNTRL0</name>
                    <displayName>CH3_CNTRL0</displayName>
                    <description>CH3 control register 0</description>
                    <addressOffset>0x00000028</addressOffset>
                </register>
