alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/SVD/MDR32VF0xI/MDR1206/MDR1206FI.svd
                <register>
                    <name>CH1_CNTRL2</name>
                    <displayName>CH1_CNTRL2</displayName>
                    <description>Control register 2 for channel 1</description>
                    <addressOffset>0x00000060</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CH_SEL1</name>
                            <description>Selects an event on CH1i to fix the CNT value in CH_CCR1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RE_CHi</name>
                                    <description>A rising edge on the CHi</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FE_CHi</name>
                                    <description>A falling edge on the CHi</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FE_CH_1</name>
                                    <description>A falling edge from other channels: 1-2, 2-3, 3-4, 4-1</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FE_CH_2</name>
                                    <description>A falling edge from other channels: 1-3, 2-4, 3-1, 4-2</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCR1_EN</name>
                            <description>Enables CH_CCR</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_RLD</name>
                            <description>Reloading of the CH_CCR and CH_CCR1</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ANY_MOMENT</name>
                                    <description>Renewal is possible at any moment</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CNT_0</name>
                                    <description>Renewal is possible when CNT==0</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EVNT_DLY</name>
                            <description>Delays the capture event until CH_CCR and CH_CCR1 are renewed</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_DELAY</name>
                                    <description>An immediate signal of the capture event.
                                    CH_CCR and CH_CCR1 are renewed in a cycle of TIM_CLK</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DELAY</name>
                                    <description>The capture event is set simultaneously with the renewal of CH_CCR and CH_CCR1</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="CH1_CNTRL2">
                    <name>CH2_CNTRL2</name>
                    <displayName>CH2_CNTRL2</displayName>
                    <description>Control register 2 for channel 2</description>
                    <addressOffset>0x00000064</addressOffset>
                </register>
                <register derivedFrom="CH1_CNTRL2">
                    <name>CH3_CNTRL2</name>
                    <displayName>CH3_CNTRL2</displayName>
                    <description>Control register 2 for channel 3</description>
                    <addressOffset>0x00000068</addressOffset>
                </register>
                <register derivedFrom="CH1_CNTRL2">
                    <name>CH4_CNTRL2</name>
                    <displayName>CH4_CNTRL2</displayName>
                    <description>Control register 2 for channel 4</description>
                    <addressOffset>0x0000006C</addressOffset>
                </register>
                <register>
                    <name>CH1_CCR1</name>
                    <displayName>CH1_CCR1</displayName>
                    <description>Capture/compare register for channel 1</description>
                    <addressOffset>0x00000070</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CH2_CCR1</name>
                    <displayName>CH2_CCR1</displayName>
                    <description>Capture/compare register for channel 2</description>
                    <addressOffset>0x00000074</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CH3_CCR1</name>
                    <displayName>CH3_CCR1</displayName>
                    <description>Capture/compare register for channel 3</description>
                    <addressOffset>0x00000078</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CH4_CCR1</name>
                    <displayName>CH4_CCR1</displayName>
                    <description>Capture/compare register for channel 4</description>
                    <addressOffset>0x0000007C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
