alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/SVD/MDR32VF0xI/MDR1206/MDR1206FI.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="PORTA">
            <name>PORTB</name>
            <description>PORTB Controller</description>
            <groupName>PORTB</groupName>
            <baseAddress>0x50088000</baseAddress>
            <interrupt>
                <name>EXT_INT2_IRQ</name>
                <value>12</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="PORTA">
            <name>PORTC</name>
            <description>PORTC Controller</description>
            <groupName>PORTC</groupName>
            <baseAddress>0x50090000</baseAddress>
            <interrupt>
                <name>EXT_INT3_IRQ</name>
                <value>13</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="PORTA">
            <name>PORTD</name>
            <description>PORTD Controller</description>
            <groupName>PORTD</groupName>
            <baseAddress>0x500F0000</baseAddress>
        </peripheral>
        <peripheral>
            <name>CRC</name>
            <description>CRC Controller</description>
            <groupName>CRC</groupName>
            <baseAddress>0x50098000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CTRL</name>
                    <displayName>CTRL</displayName>
                    <description>Control Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CRCEN</name>
                            <description>Enables the CRC controller</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DATAINV</name>
                            <description>Sequence order of CRC calculation</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Least_signif_bit</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Most_signif_bit</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DMAEN</name>
                            <description>Enables request to DMA</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DLSIZE</name>
                            <description>The size of the loaded data</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Byte</name>
                                    <description>which is written in CRC_DATAI[7:0]</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Halfword</name>
                                    <description>which is written in CRC_DATAI[15:0]</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Word</name>
                                    <description>which is written in CRC_DATAI[31:0]</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DCSIZE</name>
                            <description>Data size for CRC calculation</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Calc_Byte</name>
                                    <description>Calculation is fulfilled for a byte. DLSize=00,01,10</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Calc_Halfword</name>
                                    <description>Calculation is fulfilled for a byte. DLSize=01,10</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Calc_Word</name>
                                    <description>Calculation is fulfilled for a byte. DLSize=10 only</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STAT</name>
                    <displayName>STAT</displayName>
                    <description>Status Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CONVCOMP</name>
                            <description>CRC Status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Calc_On</name>
                                    <description>Calculation is being performed</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Calc_Off</name>
                                    <description>Calculation is fulfilled or the CRC controller is disabled</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FIFOFULL</name>
                            <description>FIFO state</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Not_Full</name>
                                    <description>FIFO has at least one empty bit</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Full</name>
                                    <description>FIFO is full</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FIFOEMPTY</name>
                            <description>FIFO state</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Not_Empty</name>
                                    <description>FIFO has at least one written bit</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Empty</name>
                                    <description>FIFO is empty</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FIFOOVER</name>
                            <description>FIFO overflow</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>OK</name>
                                    <description>Correct operation</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Lost</name>
                                    <description>A write into the full FIFO has led to the data loss</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATAI</name>
                    <displayName>DATAI</displayName>
                    <description>Register for writing a new sample into FIFO</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <fields>
                        <field>
                            <name>DATA_IN</name>
                            <description>DATA for a new FIFO sample</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VAL</name>
                    <displayName>VAL</displayName>
                    <description>Calculated CRC Value Register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CRCOUT</name>
                            <description>Calculated or initial value. Write an initial value when the CRC controller is disabled or the calculation has been finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POL</name>
                    <displayName>POL</displayName>
                    <description>Polynomial for CRC</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CRC_POL</name>
                            <description>16-bit CRC. The least and the most significant bits are always "1" and cannot be changed</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>17</bitWidth>
                        </field>
                    </fields>
                </register>
